solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf1550/fsl_pf1550.c
static uint8_t PF1550_GetRegulatorSetPoint(pf1550_handle_t *handle, pf1550_module_t module, uint32_t voltage)
{
    uint8_t regulatorSetPoint = 0U;
    uint32_t index;

    assert(handle);
    assert((kPF1550_ModuleSwitch1 == module) || (kPF1550_ModuleSwitch2 == module) ||
           (kPF1550_ModuleSwitch3 == module) || (kPF1550_ModuleLdo1 == module) || (kPF1550_ModuleLdo2 == module) ||
           (kPF1550_ModuleLdo3 == module));

    switch (module)
    {
        /* Process Switch X. */
        case kPF1550_ModuleSwitch1:
        case kPF1550_ModuleSwitch2:
            /* Find the first Vset_point >= voltage */
            for (index = 0U; index < PF1550_SWX_SET_POINT_NUM; index++)
            {
                if ((PF1550_SWX_OUTPUT_LIMIT_LOW_DVS + (PF1550_SWX_OUTPUT_STEP_DVS * index)) >= voltage)
                {
                    regulatorSetPoint = (uint8_t)index;
                    break;
                }
            }
            /* Not found, Desired voltage is beyond upper limit. */
            if (PF1550_SWX_SET_POINT_NUM == index)
            {
                /* Use Vset_point_max as actual Voutput. */
                regulatorSetPoint = PF1550_SWX_SET_POINT_NUM - 1U;
            }
            break;

        /* Process Switch Y. */
        case kPF1550_ModuleSwitch3:
            for (index = 0U; index < PF1550_SWY_SET_POINT_NUM; index++)
            {
                if ((PF1550_SWY_OUTPUT_LIMIT_LOW + (PF1550_SWY_OUTPUT_STEP * index)) >= voltage)
                {
                    regulatorSetPoint = (uint8_t)index;
                    break;
                }
            }
            /* Desired voltage is beyond upper limit. */
            if (PF1550_SWY_SET_POINT_NUM == index)
            {
                regulatorSetPoint = PF1550_SWY_SET_POINT_NUM - 1U;
            }
            break;

        /* Process LDO X. */
        case kPF1550_ModuleLdo2:
            for (index = 0U; index < PF1550_LDOX_SET_POINT_NUM; index++)
            {
                if ((PF1550_LDOX_OUTPUT_LIMIT_LOW + (PF1550_LDOX_OUTPUT_STEP * index)) >= voltage)
                {
                    regulatorSetPoint = (uint8_t)index;
                    break;
                }
            }
            /* Desired voltage is beyond upper limit. */
            if (PF1550_LDOX_SET_POINT_NUM == index)
            {
                regulatorSetPoint = PF1550_LDOX_SET_POINT_NUM - 1U;
            }
            break;

        /* Process LDO Y. */
        case kPF1550_ModuleLdo1:
        case kPF1550_ModuleLdo3:
            for (index = 0U; index < PF1550_LDOY_SET_POINT_NUM; index++)
            {
                if (((index < PF1550_LDOY_SET_POINT_LOW_NUM) &&
                     ((PF1550_LDOY_OUTPUT_LIMIT_LOW + (PF1550_LDOY_OUTPUT_STEP_LOW * index)) >= voltage)) ||
                    ((index >= PF1550_LDOY_SET_POINT_LOW_NUM) &&
                     ((PF1550_LDOY_OUTPUT_LIMIT_MID +
                       (PF1550_LDOY_OUTPUT_STEP_HIGH * (index - PF1550_LDOY_SET_POINT_LOW_NUM))) >= voltage)))
                {
                    regulatorSetPoint = (uint8_t)index;
                    break;
                }
            }
            /* Desired voltage is byond upper limit. */
            if (PF1550_LDOY_SET_POINT_NUM == index)
            {
                regulatorSetPoint = PF1550_LDOY_SET_POINT_NUM - 1U;
            }
            break;

        default:
            assert(false);
            break;
    }

    return regulatorSetPoint;
}

static uint32_t PF1550_GetRegulatorOutputVolt(pf1550_handle_t *handle, pf1550_module_t module, uint8_t voltRegContent)
{
    uint32_t voltage;

    assert(handle);
    assert((kPF1550_ModuleSwitch1 == module) || (kPF1550_ModuleSwitch2 == module) ||
           (kPF1550_ModuleSwitch3 == module) || (kPF1550_ModuleLdo1 == module) || (kPF1550_ModuleLdo2 == module) ||
           (kPF1550_ModuleLdo3 == module));

    switch (module)
    {
        /* Process Switch X. */
        case kPF1550_ModuleSwitch1:
        case kPF1550_ModuleSwitch2:
            /* Get Set Point when Switch DVS feature is enabled. */
            if (true == PF1550_IsRegulatorSupportDvs(handle, module))
            {
                voltage = PF1550_SWX_OUTPUT_LIMIT_LOW_DVS + (uint32_t)PF1550_SWX_OUTPUT_STEP_DVS * voltRegContent;
            }
            /* Get Set Point when Switch DVS feature is disable. */
            else
            {
                if (sizeof(regulatorSwVoltSetPonitTab) / sizeof(regulatorSwVoltSetPonitTab[0]) <= voltRegContent)
                {
                    voltage = regulatorSwVoltSetPonitTab[(sizeof(regulatorSwVoltSetPonitTab) /
                                                          sizeof(regulatorSwVoltSetPonitTab[0])) -
                                                         1U];
                }
                else
                {
                    voltage = regulatorSwVoltSetPonitTab[voltRegContent];
                }
            }
            break;

        /* Process Switch Y. */
        case kPF1550_ModuleSwitch3:
            voltage = PF1550_SWY_OUTPUT_LIMIT_LOW + (PF1550_SWY_OUTPUT_STEP * voltRegContent);
            break;

        /* Process LDO X. */
        case kPF1550_ModuleLdo2:
            voltage = PF1550_LDOX_OUTPUT_LIMIT_LOW + (PF1550_LDOX_OUTPUT_STEP * voltRegContent);
            break;

        /* Process LDO Y. */
        case kPF1550_ModuleLdo1:
        case kPF1550_ModuleLdo3:
            if (PF1550_LDOY_SET_POINT_LOW_NUM <= voltRegContent)
            {
                voltage = PF1550_LDOY_OUTPUT_LIMIT_MID +
                          (PF1550_LDOY_OUTPUT_STEP_HIGH * ((uint32_t)voltRegContent - PF1550_LDOY_SET_POINT_LOW_NUM));
            }
            else
            {
                voltage = PF1550_LDOY_OUTPUT_LIMIT_LOW + (PF1550_LDOY_OUTPUT_STEP_LOW * (uint32_t)voltRegContent);
            }
            break;

        default:
            voltage = 0U;
            break;
    }

    return voltage;
}

