solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf1550/fsl_pf1550.c
                case kPF1550_OperatingStatusStandby:
                    (void)PF1550_ReadReg(handle, regulatorVoltRegAddr + (PF1550_SW1_STBY_VOLT - PF1550_SW1_VOLT),
                                         &regulatorVoltRegContent);
                    voltage = PF1550_GetRegulatorOutputVolt(handle, module, regulatorVoltRegContent);
                    break;

                case kPF1550_OperatingStatusSleep:
                    (void)PF1550_ReadReg(handle, regulatorVoltRegAddr + (PF1550_SW1_SLP_VOLT - PF1550_SW1_VOLT),
                                         &regulatorVoltRegContent);
                    voltage = PF1550_GetRegulatorOutputVolt(handle, module, regulatorVoltRegContent);
                    break;

                default:
                    voltage = 0U;
                    break;
            }
            break;

        case kPF1550_ModuleVsnvs:
            voltage = PF1550_VSNVS_OUTPUT_VOLTAGE;
            break;

        /* Vref DDR = Vref DDR In / 2. */
        case kPF1550_ModuleVrefDdr:
        default:
            voltage = 0U;
            break;
    }

    return voltage;
}

void PF1550_SetSwitchAttribute(pf1550_handle_t *handle,
                               pf1550_module_t module,
                               const pf1550_switch_attribute_t *attribute)
{
    uint8_t regulatorCtrlRegAddr;
    uint8_t temp;

    assert(handle);
    assert(attribute);
    assert((kPF1550_ModuleSwitch1 == module) || (kPF1550_ModuleSwitch2 == module) || (kPF1550_ModuleSwitch3 == module));

    /* Set Regulator Control Register. */
    regulatorCtrlRegAddr = regulatorCtrlRegTab[module];
    temp                 = ((attribute->enableLowPowerMode ? PF1550_SW_CTRL_LPWR_MASK : 0U) |
            (attribute->enableForcedPwm ? PF1550_SW_CTRL_FPWM_MASK : 0U) |
            (attribute->enableDischargeResistor ? PF1550_SW_CTRL_RDIS_EN_MASK : 0U));
    if (PF1550_IsRegulatorSupportDvs(handle, module))
    {
        temp |= (PF1550_SW_CTRL_DVSSPEED(attribute->dvsSpeed) |
                 (attribute->enableForcedPwmInDvs ? PF1550_SW_CTRL_FPWM_IN_DVS_MASK : 0U));
    }
    (void)PF1550_ModifyReg(handle, regulatorCtrlRegAddr,
                           PF1550_SW_CTRL_RDIS_EN_MASK | PF1550_SW_CTRL_FPWM_MASK | PF1550_SW_CTRL_FPWM_IN_DVS_MASK |
                               PF1550_SW_CTRL_DVSSPEED_MASK | PF1550_SW_CTRL_LPWR_MASK,
                           temp);

    /* Set Power Down Control Register. */
    (void)PF1550_WriteReg(handle, powerDownRegTab[module], (uint8_t)attribute->powerDownSequence);

    switch (module)
    {
        case kPF1550_ModuleSwitch1:
            (void)PF1550_WriteReg(handle, PF1550_SW1_CTRL1, (uint8_t)attribute->currentLimit);
            break;

        case kPF1550_ModuleSwitch2:
            (void)PF1550_WriteReg(handle, PF1550_SW2_CTRL1, (uint8_t)attribute->currentLimit);
            break;

        case kPF1550_ModuleSwitch3:
            (void)PF1550_WriteReg(handle, PF1550_SW3_CTRL1, (uint8_t)attribute->currentLimit);
            break;

        default:
            assert(false);
            break;
    }
}

void PF1550_SetLdoAttribute(pf1550_handle_t *handle, pf1550_module_t module, const pf1550_ldo_attribute_t *attribute)
{
    assert(handle);
    assert(attribute);
    assert((kPF1550_ModuleLdo1 == module) || (kPF1550_ModuleLdo2 == module) || (kPF1550_ModuleLdo3 == module));

    /* Set Power Down Control Register. */
    (void)PF1550_WriteReg(handle, powerDownRegTab[module], (uint8_t)attribute->powerDownSequence);

    /* Set LDO to load switch mode. */
    switch (module)
    {
        case kPF1550_ModuleLdo1:
            (void)PF1550_ModifyReg(handle, PF1550_LDO1_CTRL, PF1550_LDO_CTRL_LPWR_MASK | PF1550_LDO_CTRL_LS_EN_MASK,
                                   (attribute->enableLowPowerMode ? PF1550_LDO_CTRL_LPWR_MASK : 0U) |
                                       (attribute->enableLoadSwitch ? PF1550_LDO_CTRL_LS_EN_MASK : 0U));
            break;

        case kPF1550_ModuleLdo2:
            /* LDO2 does not support Load Switch Mode. */
            (void)PF1550_ModifyReg(handle, PF1550_LDO2_CTRL, PF1550_LDO_CTRL_LPWR_MASK,
                                   (attribute->enableLowPowerMode ? PF1550_LDO_CTRL_LPWR_MASK : 0U));
            break;

        case kPF1550_ModuleLdo3:
            (void)PF1550_ModifyReg(handle, PF1550_LDO3_CTRL, PF1550_LDO_CTRL_LPWR_MASK | PF1550_LDO_CTRL_LS_EN_MASK,
                                   (attribute->enableLowPowerMode ? PF1550_LDO_CTRL_LPWR_MASK : 0U) |
                                       (attribute->enableLoadSwitch ? PF1550_LDO_CTRL_LS_EN_MASK : 0U));
            break;

        default:
            assert(false);
            break;
    }
}

void PF1550_SetVrefDdrAttribute(pf1550_handle_t *handle, const pf1550_vrefddr_attribute_t *attribute)
{
    assert(handle);
    assert(attribute);

    /* Set Power Down Control Register. */
    (void)PF1550_WriteReg(handle, powerDownRegTab[kPF1550_ModuleVrefDdr], (uint8_t)attribute->powerDownSequence);
}

void PF1550_SetVsnvsAttribute(pf1550_handle_t *handle, const pf1550_vsnvs_attribute_t *attribute)
{
    assert(handle);
    assert(attribute);

    /* Set Coin Cell Control Register. */
    (void)PF1550_WriteReg(handle, PF1550_COINCELL_CONTROL,
                          (uint8_t)attribute->coinCellChargingVoltage |
                              (attribute->enableCoinCellCharger ? PF1550_COINCELL_CONTROL_COINCHEN_MASK : 0U));

    /* Set Vsnvs Control Register. */
    (void)PF1550_ModifyReg(handle, PF1550_VSNVS_CTRL, PF1550_VSNVS_CTRL_LIBGDIS_MASK,
                           attribute->enableLocalBandgapInCoinCellMode ? PF1550_VSNVS_CTRL_LIBGDIS_MASK : 0U);
}

void PF1550_SetOnKeyPadAttibute(pf1550_handle_t *handle, const pf1550_onkey_attribute_t *attribute)
{
    assert(handle);
    assert(attribute);

    /* Set Power Control Register 1. */
    (void)PF1550_ModifyReg(handle, PF1550_PWRCTRL1, PF1550_PWRCTRL1_ONKEYDBNC_MASK | PF1550_PWRCTRL1_ONKEY_RST_EN_MASK,
                           (PF1550_PWRCTRL1_ONKEYDBNC(attribute->debounce) |
                            (attribute->enableTurnOffSystemViaOnkey ? PF1550_PWRCTRL1_ONKEY_RST_EN_MASK : 0U)));

